{"title":["Afriphone","What do I need to use Unlimited Mobile app ?","Are there any service fees?","Does Unlimited Mobile app work on WiFi, 3G, ADSL, Edge connectivity?","How to setup Unlimited Mobile App?","VoIP","My number shows as spam on truecaller, What can i do?","How Can i TopUp my airtime?","Can I port my telephone number to Cloud Telecoms ?","Can i port my number if my account is outstanding?","Can I port a number linked to a fibre line?","What are the SIP and config settings for Cloud Telecoms account?","Does my airtime expire?","Can I set my caller ID to my mobile number?","How do I setup my Voicemail and can I use Voicemail to Email?","Can I block certain numbers from being dialled?","How to setup Asterisk-based PBX? ","Inbound Calls & Phone Registration troubleshooting guide","Outgoing Phone Calls troubleshooting guide","How to setup Desktop IP Phone?"],"subtitle":["Possible Answer","1. An uncongested Internet connection such as Fibre to the Home (FTTH) or Fixed Home LTE.\r\n\r\n2. A SIP Account.\r\n\r\n3. A Mastercard or Visa card to purchase prepaid air time.\r\n\r\n","There are no service fees for the Afriphone service.\r\n\r\n1. No sign up fees.\r\n2. No monthly service fees.\r\n3. No service cancellation fees.\r\n\r\nNumber Porting is available at once-off cost of R130 incl VAT.\r\n","The Afriphone service is entirely dependent on the quality of the Internet connection you are using when making or receiving a phone call. Hence we only recommend connections that do not generally suffer from congestion or high latency such as FTTH (Fibre to the Home) or Fixed Home LTE (Telkom).\r\n\r\nSometimes other connectivity types, such as ADSL, 3G, Edge, WiFI or Mobile LTE will work. However, we do NOT recommend relying on these connectivity types as they are prone to congestion and high latency which result in poor call quality.","Create a new account and add details from Extension email sent to you as below:\r\n\r\nLabel \/ Account Name \/ Display Name: Extension Username as per email sent to you\r\n\r\nUsername \/ Register Name: Extension Username as per email sent to you\r\n\r\nPassword: Extension Password as per email sent to you\r\n\r\nSip Server: Extension Sip Server as per email sent to you\r\n\r\nTransport Type: TCP\r\nAudio Codec Settings: aLAW\r\nSubscribe for Register: Enabled\r\n\r\nSave\r\n\r\nRegister status should say: Registered\r\n\r\nIf not, double check the above details or send an email to support.","","Go to https:\/\/www.truecaller.com\/unlisting\r\nto unlist your number.","Login to your portal, \r\nclick on customers - place order,\r\ndoc type - select Order,\r\nchoose your airtime package.\r\nplace your order.\r\n\r\nThen click on customers - Make Payment to make payment to your account.\r\n","- Yes geographic landline numbers can be ported to Cloud Telecoms.\r\n- This include’s all South African numbers that start with 01, 02, 03, 04 and 05.\r\n- Mobile numbers such 083, 072 and 061 cannot be ported to Cloud Telecoms.\r\n\r\nThe once off cost to Port your number to Cloud Telecoms is R130.\r\n\r\nTo Port your number to Cloud Telecoms\r\n\r\n1. You login into your Cloud Telecoms account\r\n2. You click on DID Manager\r\n3. Click Port Number\r\n4. You will need to provide documents and complete the application form.\r\n5. You will receive an invoice for R130 that will need to be paid via Mastercard or Visa before your application is processed.\r\n\r\nYou will need to have the following on hand.\r\n\r\n1. A copy of your current service providers invoice and it must display the number you wish to Port.\r\n2. A scanned JPG or PDF of the ID of the account holder.\r\n3. The account holder will need to sign the application forms and authorisation letter.","A number must already be suspended for arrears at the time the port out request was logged.\r\n\r\n  1.  In terms of the Functional Specification for Geographic Number\r\nPortability Government Gazette 30089 (“FSS”) as published on 13 July 2007, specifically section 4(9)(d) and section 4(11), a donor operator cannot reject a port on the basis that the subscriber still owes monies nor may the donor operator delay a port pending the settlement of outstanding monies.","No, unfortunately this cannot be done. ","Config Settings:\r\n\r\nSoftphone or your SIP phone compatible Device settings\r\n\r\n1.Check your email for an email titled PBX Extension.\r\n2. Use registration details from email.\r\n3. Audio codec =G729 alternatively OPUS or GSM\r\n4. Network should be set to DHCP (This is the default) \r\n\r\nSettings for your Internet Router\r\n\r\nSIP ALG = Should be disabled on your Internet router (usually found under security). If not disabled SIP ALG can cause problems with calls such as randomly cutting calls and\/or your registration with the server. You can ask your Internet service provider (ISP) to help you disable SIP ALG.\r\n\r\n","We would prefer your Air Time to never expire, however we require a protection mechanism against users who sign up for accounts but never use them. We provide a single 087 telephone number for free. By ICASA regulations unused numbers can be recycled without notice.\r\n\r\n1. Your account will be cancelled and your Air Time expired after 6 (six) months of no call usage or top ups.\r\n2. Your phone number will be recycled and go back into the available pool of telephone numbers for new users.\r\n3. You will be sent emails to your registered email address to warn you that your account is expiring within 1 month, 2 weeks, 3, 2 and 1 day before it expires to give you the chance to make a call or add air time to prevent the cancellation of your account.","Not at this stage, we are working with service providers and ICASA to re-instate this ability.\r\n\r\nPlease note that it is illegal to use any caller ID (number) that is not under your ownership. To do this is considered fraud. If these regulations are broken, your account will be suspended without notice and you may face criminal charges.","On your account dashboard there is a “voice mail” section where you can follow a few simple steps to setup your voicemail.\r\n\r\n1. Type in your “Display Name”\r\n2. Select a 3 or 4 digit pin\r\n3. Dial *85 on your phone and follow the voice prompts to complete the process\r\n\r\nTo setup voicemail to email, simply type in your email address in voicemail settings and select save\/enable.\r\nAll voicemails will be sent to your email address as a sound file attachment.\r\nVoicemail to email is a much more efficient way of receiving voice mails, it simply arrives in your INBOX and you click the file to listen to it, you do not have to dial in to listen to, save and delete voice messages.\r\n\r\n","Yes, you can block individual numbers using your blacklist function and block countries from your country codes function.\r\n\r\nFrom the dashboard page, select the “Dialing Restrictions” tab on the right. This will take you to the “Black Lists” and “Country Codes” settings.","Inbound Route\r\ntype=peer,\r\nsecret=password,\r\nusername=101,\r\nhost=domain.cloudtools.co.za,\r\nfromuser=101,\r\ncanreinvite=yes,\r\ninsecure=invite,port,\r\nqualify=yes,\r\nnat=yes,\r\nport=5060,\r\ncontext=from-trunk,\r\nregister => ,101:password@yourdomain.cloudtools.co.za\/101","Not registering\r\n1. Use https:\/\/youfiles.herokuapp.com\/telnetclient\/ to Telnet to port 5060 on 156.0.96.60\r\n2. Set the phone setting \"Sip Keepalive\" value to a lower amount of seconds.\r\n\r\nInbound and Audio Issues\r\n1. Reboot your phone.\r\n2. Double check your sip account credentials, Account Balance and Cloudtime Balance\r\n3. Check your internet connectivity by visiting www.google.co.za\r\n4. Go to our portal, Click Registrations - Click \"Check your Firewall IP Blocked Status\" to unblock your IP.\r\n5. Disable firewall and NAT settings on your router.\r\n6. Disable SIP ALG on your router.\r\n8. Check that your upload speed is greater than 5MBps using www.speedtest.net\r\n9. Check that your codecs are exactly in this order G.711A (ALAW), G729.\r\n10. Reset your phone to factory settings and set up your account again (don't change any other settings).\r\n11.  Try changing the phone or the network connection.\r\n\r\nGive us a call to connect a phone to the extension for testing.\r\nIf problem persists, you will be required to install AnyDesk on a PC on your network and provide login details.\r\nOutgoing Phone Calls troubleshooting guide","1. Check that your phone is registered, if not folow the \"Phone Registration troubleshooting guide\"\r\n2. Double check your sip account credentials, Account Balance and Airtime Balance\r\n3. Check your internet connectivity by visiting www.google.co.za\r\n4. Check that your Caller ID is a valid local landline number\r\n5. Call us for support\r\n","Connect to Internet - Wired\r\nConnect a LAN Cable\r\n\r\nConnect to Internet - Wireless\r\nClick the Settings Button\r\nEnable Wi-Fi\r\nSelect a Network\r\nPut in your network password\r\n\r\nLog onto the web interface\r\nClick the center tick button to find the ip address of the phone.\r\nEnter the IP Address into a web browser of a PC on the same network.\r\nUsername: admin\r\nPassword: admin\r\n\r\nEnter the registration details\r\nClick on the Account Tab and add details from Extension email sent to you as below:\r\nLabel: Extension Username as per email sent to you\r\nDisplay Name: Extension Username as per email sent to you\r\nRegister Name: Extension Username as per email sent to you\r\nUsername: Extension Username as per email sent to you\r\nPassword: Extension Password as per email sent to you\r\nSip Server: Extension Sip Server as per email sent to you\r\nTransport Type: TCP\r\nClick Confirm\r\nRefresh the Page\r\nCheck that the register status says: Registered\r\nIf not, double check the above details.\r\n\r\nFix your Codecs\r\nClick on Codecs and make sure you enable the following in order: PCMA(G711A), G729"],"id":["0","1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19"],"itemType":["1","0","","0","0","1","0","0","0","0","0","0","0","0","0","0","0","0","0","0"]}